# Space_AddAreaModifierToSpace

## Description
Add Area Modifier to a space object.

```pascal
PROCEDURE Space_AddAreaModifierToSpace(
				space    : HANDLE;
				modifier : STRING);
```

```python
def vs.Space_AddAreaModifierToSpace(space, modifier):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE|   |
|modifier|STRING|   |

## Version
Availability: from Vectorworks 2014 - renamed [[VS:Space_AddAreaModif]] with Vectorworks 2024.

## Category
* SpaceObjectCoreTools